{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.5.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_9_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 256, 256, 1], "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_10", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_11", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": false, "label_smoothing": 0.0, "axis": -1}}, "metrics": [[{"class_name": "CategoricalAccuracy", "config": {"name": "categorical_accuracy", "dtype": "float32"}}, {"class_name": "Precision", "config": {"name": "precision_3", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall_3", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "AUC", "config": {"name": "auc_3", "dtype": "float32", "num_thresholds": 200, "curve": "ROC", "summation_method": "interpolation", "multi_label": false, "num_labels": null, "label_weights": null, "from_logits": false}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0015869364142417908, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of57.bin", "group1-shard2of57.bin", "group1-shard3of57.bin", "group1-shard4of57.bin", "group1-shard5of57.bin", "group1-shard6of57.bin", "group1-shard7of57.bin", "group1-shard8of57.bin", "group1-shard9of57.bin", "group1-shard10of57.bin", "group1-shard11of57.bin", "group1-shard12of57.bin", "group1-shard13of57.bin", "group1-shard14of57.bin", "group1-shard15of57.bin", "group1-shard16of57.bin", "group1-shard17of57.bin", "group1-shard18of57.bin", "group1-shard19of57.bin", "group1-shard20of57.bin", "group1-shard21of57.bin", "group1-shard22of57.bin", "group1-shard23of57.bin", "group1-shard24of57.bin", "group1-shard25of57.bin", "group1-shard26of57.bin", "group1-shard27of57.bin", "group1-shard28of57.bin", "group1-shard29of57.bin", "group1-shard30of57.bin", "group1-shard31of57.bin", "group1-shard32of57.bin", "group1-shard33of57.bin", "group1-shard34of57.bin", "group1-shard35of57.bin", "group1-shard36of57.bin", "group1-shard37of57.bin", "group1-shard38of57.bin", "group1-shard39of57.bin", "group1-shard40of57.bin", "group1-shard41of57.bin", "group1-shard42of57.bin", "group1-shard43of57.bin", "group1-shard44of57.bin", "group1-shard45of57.bin", "group1-shard46of57.bin", "group1-shard47of57.bin", "group1-shard48of57.bin", "group1-shard49of57.bin", "group1-shard50of57.bin", "group1-shard51of57.bin", "group1-shard52of57.bin", "group1-shard53of57.bin", "group1-shard54of57.bin", "group1-shard55of57.bin", "group1-shard56of57.bin", "group1-shard57of57.bin"], "weights": [{"name": "conv2d_10/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 1, 32], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [115200, 512], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [512, 2], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [2], "dtype": "float32"}]}]}